renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_pstd_pcd_task
 Description     : The Peripheral Control Driver(PCD) task.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_pcd_task (void)
{
#if (BSP_CFG_RTOS_USED == 0)
    if (g_usb_pstd_usb_int.wp != g_usb_pstd_usb_int.rp)
    {
        /* Pop Interrupt info */
        usb_pstd_interrupt(g_usb_pstd_usb_int.buf[g_usb_pstd_usb_int.rp].type,
                g_usb_pstd_usb_int.buf[g_usb_pstd_usb_int.rp].status);

        /* Read CountUp */
        g_usb_pstd_usb_int.rp = ((g_usb_pstd_usb_int.rp + 1) % USB_INT_BUFSIZE);
    }
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))
    usb_cstd_dma_driver();           /* USB DMA driver */
#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */
#endif /*(BSP_CFG_RTOS_USED == 0)*/

#if (BSP_CFG_RTOS_USED == 1)
    usb_er_t    err;
    usb_utr_t   *p_mess;

    /* WAIT_LOOP */
    while(1)
    {
        err = USB_TRCV_MSG(USB_PCD_MBX, (usb_msg_t **)&p_mess, (usb_tm_t)1000);
        if (USB_OK == err)
        {
            switch (p_mess->msginfo)
            {
                case USB_MSG_PCD_INT:
                    usb_pstd_interrupt(p_mess);
                break;

                case USB_MSG_PCD_SUBMITUTR:
                    usb_pstd_set_submitutr(p_mess);
                break;

                case USB_MSG_PCD_TRANSEND1:
                    usb_pstd_forced_termination(p_mess->keyword, (uint16_t)USB_DATA_STOP);
                break;

                case USB_MSG_PCD_REMOTEWAKEUP:
                    usb_pstd_self_clock();
                    usb_pstd_remote_wakeup();
                break;

                default:
                break;
            }
        }
    }
#endif /*(BSP_CFG_RTOS_USED == 1)*/
}
/******************************************************************************
 End of function usb_pstd_pcd_task
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_set_submitutr
 Description     : USB Peripheral Submit utr.
 Arguments       : usb_utr_t *utrmsg    : Pointer to usb_utr_t structure
 Return value    : usb_er_t
 ******************************************************************************/
usb_er_t usb_pstd_set_submitutr (usb_utr_t * utrmsg)
{
    uint16_t pipenum;

    pipenum = utrmsg->keyword;

#if (BSP_CFG_RTOS_USED == 0)
    g_p_usb_pstd_pipe[pipenum] = utrmsg;
#endif /* (BSP_CFG_RTOS_USED == 0) */

    /* Check state (Configured) */
    if (USB_TRUE == usb_pstd_chk_configured())
    {
#if (BSP_CFG_RTOS_USED == 1)
        if (USB_NULL != g_p_usb_pstd_pipe[pipenum])
        {
            usb_cstd_pipe_msg_forward (utrmsg, pipenum);
            return USB_OK;
        }
#endif /* BSP_CFG_RTOS_USED == 1 */

#if (BSP_CFG_RTOS_USED == 1)
        g_p_usb_pstd_pipe[pipenum] = utrmsg;
#endif /* (BSP_CFG_RTOS_USED == 1) */

        /* Data transfer */
        if (USB_DIR_P_OUT == usb_cstd_get_pipe_dir(USB_NULL, pipenum))
        {
            usb_pstd_receive_start(pipenum);    /* Out transfer */
        }
        else
        {
            /* In transfer */
            usb_pstd_send_start(pipenum);
        }
    }
    else
    {
#if (BSP_CFG_RTOS_USED == 1)
        if (USB_PIPE0 == pipenum)
        {
            usb_cstd_pipe0_msg_clear (utrmsg, 0);
        }
        else
        {
            usb_cstd_pipe_msg_clear (utrmsg, pipenum);
        }
#else /* BSP_CFG_RTOS_USED == 1 */
        /* Transfer stop */
        usb_pstd_forced_termination(pipenum, (uint16_t) USB_DATA_ERR);
#endif /* (BSP_CFG_RTOS_USED == 1) */
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_pstd_set_submitutr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_clr_alt
 Description     : Zero-clear the alternate table (buffer).
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_clr_alt (void)
{
    uint16_t i;

    /* WAIT_LOOP */
    for (i = 0; i < USB_ALT_NO; ++i)
    {
        /* Alternate table clear */
        g_usb_pstd_alt_num[i] = 0;
    }
}
/******************************************************************************
 End of function usb_pstd_clr_alt
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_clr_mem
 Description     : Initialize global variables defined for peripheral mode.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_clr_mem (void)
{
    g_usb_pstd_config_num = 0;               /* Configuration number */
    g_usb_pstd_remote_wakeup = USB_FALSE;    /* Remote wake up enable flag */
    usb_pstd_clr_alt();                      /* Alternate setting clear */
}
/******************************************************************************
 End of function usb_pstd_clr_mem
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_set_config_num
 Description     : Set specified configuration number.
 Arguments       : uint16_t value    : Configuration number
 Return value    : none
 ******************************************************************************/
void usb_pstd_set_config_num (uint16_t value)
{
    g_usb_pstd_config_num = value;    /* Set configuration number */
    usb_pstd_clr_alt();               /* Alternate setting clear */
}
/******************************************************************************
 End of function usb_pstd_set_config_num
 ******************************************************************************/

