renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_pstd_clr_eptbl_index
 Description     : Clear Endpoint Index Table (buffer).
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_clr_eptbl_index (void)
{
    uint16_t i;

    /* WAIT_LOOP */
    for (i = 0; i <= USB_MAX_EP_NO; ++i)
    {
        /* EndPoint index table clear */
        g_usb_pstd_eptbl_index[0][i] = USB_ERROR;
        g_usb_pstd_eptbl_index[1][i] = USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_pstd_clr_eptbl_index
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_get_interface_num
 Description     : Get interface number
 Arguments       : void
 Return value    : uint16_t         : Number of this interface(bNumInterfaces)
 ******************************************************************************/
uint16_t usb_pstd_get_interface_num (void)
{
    uint16_t num_if = 0;

    /* Get NumInterfaces.        4:bNumInterfaces */
    num_if = *(uint8_t *) (g_usb_pstd_driver.p_configtbl + USB_DEV_B_NUM_INTERFACES);

    return num_if;
}
/******************************************************************************
 End of function usb_pstd_get_interface_num
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_get_alternate_num
 Description     : Get Alternate Setting Number
 Arguments       : uint16_t con_num : Configuration Number
                 : uint16_t int_num : Interface Number
 Return value    : uint16_t         : Value used to select this alternate (bAlternateSetting)
 ******************************************************************************/
uint16_t usb_pstd_get_alternate_num (uint16_t int_num)
{
    uint16_t i;
    uint16_t alt_num = 0;
    uint8_t * ptr;
    uint16_t length;

    ptr = g_usb_pstd_driver.p_configtbl;
    i = ptr[0];

    /* Interface descriptor[0] */
    ptr = (uint8_t *) ((uint32_t) ptr + ptr[0]);
    length = (uint16_t) (*(uint8_t *) ((uint32_t) g_usb_pstd_driver.p_configtbl + (uint16_t) 2u));
    length |= (uint16_t) ((uint16_t) (*(uint8_t *) ((uint32_t) g_usb_pstd_driver.p_configtbl + (uint16_t) 3u)) << 8u);

    /* Search descriptor table size */
    /* WAIT_LOOP */
    for (; i < length;)
    {
        /* Descriptor type ? */
        switch (ptr[1])
        {
            /* Interface */
            case USB_DT_INTERFACE :
                if (int_num == ptr[2])
                {
                    /* Alternate number count */
                    alt_num = (uint16_t) ptr[3];
                }
                i += ptr[0];

                /* Interface descriptor[0] */
                ptr = (uint8_t *) ((uint32_t) ptr + ptr[0]);
            break;

                /* Device */
            case USB_DT_DEVICE :

                /* Continue */
                /* Configuration */
            case USB_DT_CONFIGURATION :

                /* Continue */
                /* String */
            case USB_DT_STRING :

                /* Continue */
                /* EndPoint */
            case USB_DT_ENDPOINT :

                /* Continue */
                /* Class, Vendor, else */
            default :
                i += ptr[0];

                /* Interface descriptor[0] */
                ptr = (uint8_t *) ((uint32_t) ptr + ptr[0]);
            break;
        }
    }
    return alt_num;
}
/******************************************************************************
 End of function usb_pstd_get_alternate_num
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_set_eptbl_index
 Description     : Set endpoint index in table (buffer) region based on config-
                 : uration descriptor. In other words, set which endpoints to
                 : use based on specified configuration,
 Arguments       : uint16_t con_num : Configuration Number.
                 : uint16_t int_num : Interface Number.
                 : uint16_t alt_num : Alternate Setting.
 Return value    : none
 ******************************************************************************/
void usb_pstd_set_eptbl_index (uint16_t int_num, uint16_t alt_num)
{
    uint8_t * ptr;
    uint16_t i;
    uint16_t j;
    uint16_t length;
    uint16_t start;
    uint16_t numbers;
    uint16_t ep;
    uint16_t dir;

    /* Configuration descriptor */
    ptr = g_usb_pstd_driver.p_configtbl;
    i = *ptr;
    length = (uint16_t) (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 3u));
    length = (uint16_t) (length << 8);
    length += (uint16_t) (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u));
    ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
    start = 0;
    numbers = 0;
    j = 0;

    /* WAIT_LOOP */
    for (; i < length;)
    {
        /* Descriptor type ? */
        switch (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 1u))
        {
            /* Interface */
            case USB_DT_INTERFACE :
                if (((*(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u)) == int_num)
                        && ((*(uint8_t *) ((uint32_t) ptr + (uint32_t) 3u)) == alt_num))
                {
                    numbers = *(uint8_t *) ((uint32_t) ptr + (uint32_t) 4u);
                }
                else
                {
                    start += (*(uint8_t *) ((uint32_t) ptr + (uint32_t) 4u));
                }
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;

                /* Endpoint */
            case USB_DT_ENDPOINT :
                if (j < numbers)
                {
                    ep = (uint16_t) *(uint8_t *) ((uint32_t) ptr + (uint32_t) 2u);
                    if (USB_EP_IN == (ep & USB_EP_DIRMASK))
                    {
                        dir = 1; /* IN */
                    }
                    else
                    {
                        dir = 0; /* OUT */
                    }
                    ep &= (uint16_t) 0x0f;
                    g_usb_pstd_eptbl_index[dir][ep] = (uint8_t) (start + j);
                    ++j;
                }
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;

                /* Device */
            case USB_DT_DEVICE :

                /* Continue */
                /* Configuration */
            case USB_DT_CONFIGURATION :

                /* Continue */
                /* String */
            case USB_DT_STRING :

                /* Continue */
                /* Class, Vendor, else */
            default :
                i += (*ptr);
                ptr = (uint8_t *) ((uint32_t) ptr + (*ptr));
            break;
        }
    }
}
/******************************************************************************
 End of function usb_pstd_set_eptbl_index
 ******************************************************************************/

