renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_pstd_transfer_start
 Description     : Transfer the data of each pipe
                 : Request PCD to transfer data, and the PCD transfers the data
                 : based on the transfer information stored in ptr
 Arguments       : usb_utr_t *ptr : Pointer to usb_utr_t structure.
 Return value    : usb_er_t       : Error info.
 ******************************************************************************/
usb_er_t usb_pstd_transfer_start(usb_utr_t * ptr)
{
    usb_er_t err;
    uint16_t pipenum;
#if (BSP_CFG_RTOS_USED == 1)
    usb_utr_t   *p_tran_data;
#endif /* BSP_CFG_RTOS_USED == 1 */

    pipenum = ptr->keyword;
    if (USB_PIPE0 == pipenum)
    {
        USB_PRINTF0("### usb_pstd_transfer_start PIPE0 is not support\n");
        return USB_ERROR;
    }

#if (BSP_CFG_RTOS_USED == 0)
    if (USB_NULL != g_p_usb_pstd_pipe[pipenum])
    {
        /* Get PIPE TYPE */
        if (USB_TYPFIELD_ISO != usb_cstd_get_pipe_type(USB_NULL, pipenum))
        {
            USB_PRINTF1("### usb_pstd_transfer_start overlaps %d\n", pipenum);
            return USB_QOVR;
        }
    }

    /* Check state (Configured) */
    if (USB_TRUE != usb_pstd_chk_configured())
    {
        USB_PRINTF0("### usb_pstd_transfer_start not configured\n");
        return USB_ERROR;
    }
    err = usb_pstd_set_submitutr(ptr);
#else /* BSP_CFG_RTOS_USED == 0 */
    ptr->msghead = (usb_mh_t) USB_NULL;
    ptr->msginfo = USB_MSG_PCD_SUBMITUTR;
    ptr->ip = USB_IP0;

    p_tran_data = (usb_utr_t *)pvPortMalloc(sizeof(usb_utr_t));
    if (NULL == p_tran_data)
    {
        return USB_ERROR;
    }
    *p_tran_data = *ptr;
    p_tran_data->cur_task_hdl  = xTaskGetCurrentTaskHandle();

    /* Send message */
    err = USB_SND_MSG(USB_PCD_MBX, (usb_msg_t* )p_tran_data);
    if (USB_OK != err)
    {
        vPortFree (p_tran_data);
    }
#endif /* (BSP_CFG_RTOS_USED == 0) */

    return err;
}
/******************************************************************************
 End of function usb_pstd_transfer_start
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_transfer_end
 Description     : Force termination of data transfer of specified pipe. Request
                 : PCD to force termination data transfer, 
                 : and the PCD forced-terminates data transfer.
 Arguments       : uint16_t pipe     : Pipe number.
 Return value    : usb_er_t          : Error info.
 ******************************************************************************/
usb_er_t usb_pstd_transfer_end(uint16_t pipe)
{
#if (BSP_CFG_RTOS_USED == 1)
    usb_utr_t   utr;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    if (USB_MAX_PIPE_NO < pipe)
    {
        return USB_ERROR; /* Error */
    }

    if (USB_NULL == g_p_usb_pstd_pipe[pipe])
    {
        USB_PRINTF0("### usb_pstd_transfer_end overlaps\n");
        return USB_ERROR;
    }
    else
    {
#if (BSP_CFG_RTOS_USED == 0)
        usb_pstd_forced_termination(pipe, (uint16_t)USB_DATA_STOP);
#else /* BSP_CFG_RTOS_USED == 0 */
        utr.msghead = (usb_mh_t) USB_NULL;
        utr.msginfo = USB_MSG_PCD_TRANSEND1;
        utr.keyword = pipe;

        /* Send message */
        return USB_SND_MSG(USB_PCD_MBX, (usb_msg_t* )&utr);
#endif /* (BSP_CFG_RTOS_USED == 0) */
    }

    return USB_OK;
}
/******************************************************************************
 End of function usb_pstd_transfer_end
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_change_device_state
 Description     : Change USB Device to the status specified by argument
 Arguments       : uint16_t state            : New device status.
                 : uint16_t keyword          : Pipe number etc.
                 : usb_cb_t complete         : Callback function.
 Return value    : none
 ******************************************************************************/
void usb_pstd_change_device_state(uint16_t state, uint16_t keyword, usb_cb_t complete)
{
    uint16_t pipenum;
#if (BSP_CFG_RTOS_USED == 1)
    static usb_utr_t   utr;
    uint16_t    err;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    pipenum = keyword;
    switch(state)
    {
        case USB_DO_STALL:
            usb_pstd_set_stall(pipenum);
            g_usb_pstd_stall_pipe[pipenum] = USB_TRUE;
            g_usb_pstd_stall_cb = complete;
        break;

        case USB_DO_REMOTEWAKEUP:
#if (BSP_CFG_RTOS_USED == 0)
            usb_pstd_self_clock();
            usb_pstd_remote_wakeup();
#else   /* BSP_CFG_RTOS_USED == 0 */
            utr.msghead = (usb_mh_t) USB_NULL;
            utr.msginfo = USB_MSG_PCD_REMOTEWAKEUP;

            /* Send message */
            err = USB_SND_MSG(USB_PCD_MBX, (usb_msg_t* )&utr);
            if (USB_OK != err)
            {
                g_usb_pstd_remote_wakeup_state = USB_ERROR;
            }

#endif  /* BSP_CFG_RTOS_USED == 0 */
        break;

        case USB_MSG_PCD_DP_ENABLE:
            hw_usb_pset_dprpu();
        break;

        case USB_MSG_PCD_DP_DISABLE:
            hw_usb_pclear_dprpu();
        break;
        
        default:
        break;
    }
}
/******************************************************************************
 End of function usb_pstd_change_device_state
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_driver_registration
 Description     : Register pipe information table, descriptor information table,
                 : callback function, etc. This info is specified by the data in
                 : the structure usb_pcdreg_t.
 Arguments       : usb_pcdreg_t *registinfo     : Class driver structure.
 Return value    : none
 ******************************************************************************/
void usb_pstd_driver_registration(usb_pcdreg_t * registinfo)
{
    usb_pcdreg_t *driver;

