renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
    driver = &g_usb_pstd_driver;

    driver->p_devicetbl = registinfo->p_devicetbl;   /* Device descriptor table address */
    driver->p_qualitbl  = registinfo->p_qualitbl;    /* Qualifier descriptor table address */
    driver->p_configtbl = registinfo->p_configtbl;   /* Configuration descriptor table address */
    driver->p_othertbl  = registinfo->p_othertbl;    /* Other configuration descriptor table address */
    driver->p_stringtbl = registinfo->p_stringtbl;   /* String descriptor table address */
    driver->devdefault  = registinfo->devdefault;    /* Device default */
    driver->devconfig   = registinfo->devconfig;     /* Device configured */
    driver->devdetach   = registinfo->devdetach;     /* Device detach */
    driver->devsuspend  = registinfo->devsuspend;    /* Device suspend */
    driver->devresume   = registinfo->devresume;     /* Device resume */
    driver->interface   = registinfo->interface;     /* Interfaced change */
    driver->ctrltrans   = registinfo->ctrltrans;     /* Control transfer */
    driver->num_string  = registinfo->num_string;    /* String descriptor number */
}
/******************************************************************************
 End of function  usb_pstd_driver_registration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_driver_release
 Description     : Clear the information registered in the structure usb_pcdreg_t.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_pstd_driver_release(void)
{
    usb_pcdreg_t *driver;

    driver = &g_usb_pstd_driver;
    driver->p_devicetbl = (uint8_t*)0u;              /* Device descriptor table address */
    driver->p_qualitbl = (uint8_t*)0u;               /* Qualifier descriptor table address */
    driver->p_configtbl = (uint8_t*)0u;              /* Configuration descriptor table address */
    driver->p_othertbl = (uint8_t*)0u;               /* Other configuration descriptor table address */
    driver->p_stringtbl = (uint8_t**)0u;             /* String descriptor table address */
    driver->devdefault = &usb_pstd_dummy_function; /* Device default */
    driver->devconfig = &usb_pstd_dummy_function;  /* Device configured */
    driver->devdetach = &usb_pstd_dummy_function;  /* Device detach */
    driver->devsuspend = &usb_pstd_dummy_function; /* Device suspend */
    driver->devresume = &usb_pstd_dummy_function;  /* Device resume */
    driver->interface = &usb_pstd_dummy_function;  /* Interfaced change */
    driver->ctrltrans = &usb_pstd_dummy_trn;       /* Control transfer */

}/* End of function usb_pstd_driver_release() */

/******************************************************************************
 Function Name   : usb_pstd_dummy_function
 Description     : dummy function
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_pstd_dummy_function(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    /* Dummy function */
}
/******************************************************************************
 End of function usb_pstd_dummy_function
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_pstd_dummy_trn
 Description     : Class request processing for dummy
 Arguments       : usb_setup_t *preq  ; Class request information
 : uint16_t ctsq        ; Control Stage
 Return value    : none
 ******************************************************************************/
void usb_pstd_dummy_trn(usb_setup_t * preq, uint16_t ctsq)
{
    /* Dummy function */
} /* End of function usb_pstd_dummy_trn */

/******************************************************************************
Function Name   : usb_pstd_device_information
Description     : Get USB Device information such as USB Device status and con-
                : figuration No. etc. 
 Arguments      : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                : uint16_t *tbl   : Device information storage pointer TBL. This 
                :                   pointer is used to provide the caller with the device's sta-
                :                   tus, speed, configuration and interface number, and the value
                :                   of the remote wakeup flag.
Return value    : none
******************************************************************************/
void usb_pstd_device_information (usb_utr_t *ptr, uint16_t *tbl)
{
    /* Device status */
    tbl[0] = hw_usb_read_intsts() & (uint16_t)(USB_VBSTS|USB_DVSQ);

    /* Speed */
    tbl[1] = usb_cstd_port_speed (ptr);

    /* Configuration number */
    tbl[2] = g_usb_pstd_config_num;

    /* Interface number */
    tbl[3] = usb_pstd_get_interface_num ();

    /* Remote Wakeup Flag */
    tbl[4] = g_usb_pstd_remote_wakeup;
}/* End of function usb_pstd_device_information() */

/******************************************************************************
Function Name   : usb_pstd_set_stall_clr_feature
Description     : Set pipe stall request
Arguments       : usb_utr_t *ptr        : Pointer to usb_utr_t structure.
                : usb_cb_t  complete    : callback function
                : uint16_t  pipe        : pipe number
Return value    : usb_er_t              : Error Info
******************************************************************************/
usb_er_t usb_pstd_set_stall_clr_feature (usb_utr_t *ptr, usb_cb_t complete, uint16_t pipe)
{
    if (USB_MAX_PIPE_NO < pipe)
    {
        return USB_ERROR; /* Error */
    }

    usb_pstd_change_device_state(USB_DO_STALL, pipe, complete);

    return USB_OK;
}
/******************************************************************************
End of function usb_pstd_set_stall_clr_feature
******************************************************************************/

