renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_peri_registration
 Description     : Registration of peripheral Devices Class Driver
 Arguments       : usb_utr_t *ptr : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void usb_peri_registration(usb_ctrl_t *ctrl, usb_cfg_t *cfg)
{
    usb_pcdreg_t pdriver;

    /* pdriver registration */
    pdriver.p_devicetbl   = cfg->p_usb_reg->p_device;           /* Device descriptor Table address */
    pdriver.p_qualitbl    = cfg->p_usb_reg->p_qualifier;        /* Qualifier descriptor Table address */
    pdriver.p_configtbl   = cfg->p_usb_reg->p_config_f;         /* Configuration descriptor Table address */
    pdriver.p_othertbl    = cfg->p_usb_reg->p_config_h;         /* Other configuration descriptor Table address */
    pdriver.p_stringtbl   = cfg->p_usb_reg->p_string;           /* String descriptor Table address */
    pdriver.num_string    = cfg->p_usb_reg->num_string;         /* Num entry String descriptor */

    pdriver.devdefault  = &usb_peri_devdefault;                 /* Device default */
    pdriver.devconfig   = &usb_peri_configured;                 /* Device configuered */
    pdriver.devdetach   = &usb_peri_detach;                     /* Device detach */
    pdriver.devsuspend  = (usb_cb_t)&usb_peri_suspended;        /* Device suspend */
    pdriver.devresume   = &usb_peri_resume;                     /* Device resume */
    pdriver.interface   = &usb_peri_interface;                  /* Interface changed */
    pdriver.ctrltrans   = (usb_cb_trn_t)&usb_peri_class_request;    /* Control Transfer */

    usb_pstd_driver_registration((usb_pcdreg_t*) &pdriver);
} /* End of function usb_peri_registration() */

/******************************************************************************
 Function Name   : usb_peri_devdefault
 Description     : Descriptor change
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t mode        ; Speed mode
                 : uint16_t data2       ; BC Port Detect Result
 Return value    : none
 ******************************************************************************/
void usb_peri_devdefault (usb_utr_t *ptr, uint16_t mode, uint16_t data2)
{
    uint8_t *ptable;
    uint16_t len;
#if (defined(USB_CFG_PCDC_USE) | defined(USB_CFG_PHID_USE))
    usb_ctrl_t ctrl;
#endif

    usb_peri_detach(ptr, USB_NULL, USB_NULL);

    /* Connect Speed = Hi-Speed? */
    if (USB_HSCONNECT == mode)
    {
        ptable = g_usb_pstd_driver.p_othertbl;

        /* Set Descriptor type.  */
        /* Hi-Speed Mode */
        if (USB_NULL != g_usb_pstd_driver.p_configtbl)
        {
            g_usb_pstd_driver.p_configtbl[1] = USB_DT_OTHER_SPEED_CONF;
        }
        if (USB_NULL != g_usb_pstd_driver.p_othertbl)
        {
            g_usb_pstd_driver.p_othertbl[1] = USB_DT_CONFIGURATION;
        }
    }
    else
    {
        ptable = g_usb_pstd_driver.p_configtbl;

        /* Set Descriptor type. */
        /* Full-Speed Mode */
        if (USB_NULL != g_usb_pstd_driver.p_configtbl)
        {
            g_usb_pstd_driver.p_configtbl[1] = USB_DT_CONFIGURATION;
        }
        if (USB_NULL != g_usb_pstd_driver.p_othertbl)
        {
            g_usb_pstd_driver.p_othertbl[1] = USB_DT_OTHER_SPEED_CONF;
        }
    }

    len = (uint16_t) (*(uint8_t*) ((uint32_t) ptable + (uint32_t) 3));
    len = (uint16_t) (len << 8);
    len += (uint16_t) (*(uint8_t*) ((uint32_t) ptable + (uint32_t) 2));

    usb_pstd_clr_pipe_table ();
    usb_peri_pipe_info(ptable, mode, len);

#if (defined(USB_CFG_PCDC_USE) | defined(USB_CFG_PHID_USE))
    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_DEFAULT, &ctrl);
#endif

} /* End of function usb_peri_devdefault() */

/******************************************************************************
 Function Name   : usb_peri_pipe_info
 Description     : Pipe Information check and EP Table Set
 Arguments       : uint8_t *table   : Check Start Descriptor address
                 : uint16_t speed   : Device connected speed
                 : uint16_t length  : Configuration Descriptor Length
 Return value    : uint16_t : USB_E_OK / USB_E_ERROR
 ******************************************************************************/
uint16_t usb_peri_pipe_info (uint8_t *table, uint16_t speed, uint16_t length)
{
    uint16_t ofdsc;
    uint16_t retval = USB_ERROR;
    uint8_t         pipe_no;

    /* Check Endpoint Descriptor */
    ofdsc = table[0];

    /* WAIT_LOOP */
    while (ofdsc < length)
    {
        /* Endpoint Descriptor */
        if ( USB_DT_ENDPOINT == table[ofdsc + USB_EP_B_DESCRIPTORTYPE])
        {
            /* EP Table pipe Information set */
            pipe_no = usb_pstd_set_pipe_table (&table[ofdsc]);
            if (USB_NULL != pipe_no)
            {
                retval = USB_OK;
            }
        }
        ofdsc += table[ofdsc];
    }
    return retval;
} /* End of function usb_peri_pipe_info() */

/******************************************************************************
 Function Name   : usb_peri_configured
 Description     : Peripheral Devices Class open function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_configured (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    g_usb_peri_connected = USB_TRUE;
    
    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_CONFIGURED, &ctrl);

#if defined(USB_CFG_PMSC_USE)
    usb_pmsc_receive_cbw();
#endif
} /* End of function usb_configured() */

/******************************************************************************
 Function Name   : usb_peri_detach
 Description     : Peripheral Devices Class close function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_detach (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    if(USB_TRUE == g_usb_peri_connected)
    {
        g_usb_peri_connected = USB_FALSE;

        ctrl.module = USB_CFG_USE_USBIP;
        usb_set_event(USB_STS_DETACH, &ctrl);
    }
} /* End of function usb_peri_detach() */

